
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |   🔴 Destroy |
|:---------:|--------:|----------:|------------:|
|     ✅     |       3 |         0 |           3 |
## Affected resources by action

|  Action  | Resources                                                                                          |
|:--------:|:---------------------------------------------------------------------------------------------------|
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions`                   |
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager`                   |
|    🟢     | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager` |
|    🟢     | `aws_dynamodb_table.terraform_locks:`                                                              |
|    🔴     | `aws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions`                          |
|    🔴     | `aws_iam_role.ih-tf-aws-control-289256138624-state-manager`                                        |
|    🔴     | `aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager`                      |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/721dd40b-8ffa-47b6-96e4-aa216649ae64/terraform-bin plan -no-color --out=tf.plan
aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230701232848037400000002]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]
aws_iam_role.ih-tf-aws-control-289256138624-state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]
aws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=2703623452]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=1759203957]
data.aws_iam_policy.administrator-access: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-permissions: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-permissions: Read complete after 0s [id=1603774485]
data.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-assume: Read complete after 0s [id=2022835186]
data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]
data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
aws_iam_role.ih-tf-aws-control-289256138624-github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]
aws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]
aws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]
data.aws_iam_policy_document.ih-tf-aws-control-289256138624-admin-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-289256138624-admin-assume: Read complete after 0s [id=413646908]
aws_iam_role.ih-tf-aws-control-289256138624-admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]
aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230701234510837900000001]
aws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions will be destroyed
  # (because aws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions is not in configuration)
  - resource "aws_iam_policy" "ih-tf-aws-control-289256138624-state-manager-permissions" {
      - arn         = "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001" -> null
      - id          = "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001" -> null
      - name        = "terraform-20230701232847347400000001" -> null
      - name_prefix = "terraform-" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUGWICM6AE5CIHYDMM" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "created_by" = "infrahouse/aws-control-289256138624"
        } -> null
    }

  # aws_iam_role.ih-tf-aws-control-289256138624-state-manager will be destroyed
  # (because aws_iam_role.ih-tf-aws-control-289256138624-state-manager is not in configuration)
  - resource "aws_iam_role" "ih-tf-aws-control-289256138624-state-manager" {
      - arn                   = "arn:aws:iam::289256138624:role/ih-tf-aws-control-289256138624-state-manager" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::990466748045:user/aleks",
                              - "arn:aws:iam::289256138624:role/ih-tf-aws-control-289256138624-github",
                            ]
                        }
                      - Sid       = "000"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-07-01T23:19:10Z" -> null
      - description           = "Role to manage state of the repo aws-control-289256138624" -> null
      - force_detach_policies = false -> null
      - id                    = "ih-tf-aws-control-289256138624-state-manager" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ih-tf-aws-control-289256138624-state-manager" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-07-02T00:38:00Z"
              - region         = "us-west-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "created_by" = "infrahouse/aws-control-289256138624"
        } -> null
      - unique_id             = "AROAUGWICM6AF2JU3CT2L" -> null
    }

  # aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager will be destroyed
  # (because aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ih-tf-aws-control-289256138624-state-manager" {
      - id         = "ih-tf-aws-control-289256138624-state-manager-20230701232848037400000002" -> null
      - policy_arn = "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001" -> null
      - role       = "ih-tf-aws-control-289256138624-state-manager" -> null
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions will be created
  + resource "aws_iam_policy" "permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "aws_dynamodb_table.terraform_locks.arn"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager will be created
  + resource "aws_iam_role" "state-manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "aws_iam_role.ih-tf-aws-control-289256138624-github.arn",
                              + "arn:aws:iam::990466748045:user/aleks",
                            ]
                        }
                      + Sid       = "000"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to manage a terraform state of a repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-aws-control-289256138624-state-manager"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
      + unique_id             = (known after apply)
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager will be created
  + resource "aws_iam_role_policy_attachment" "state-manager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-289256138624-state-manager"
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Warning: Reference to undefined provider

  on aws_iam_role.ih-tf-aws-control-289256138624-state-manager.tf line 6, in module "ih-tf-aws-control-289256138624-state-manager":
   6:     aws = aws.aws-289256138624-uw1

There is no explicit declaration for local provider name "aws" in
module.ih-tf-aws-control-289256138624-state-manager, so Terraform is assuming
you mean to pass a configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230701232848037400000002]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Aaws_iam_role.ih-tf-aws-control-289256138624-state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Aaws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=2703623452]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=1759203957]%0Adata.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-permissions: Read complete after 0s [id=1603774485]%0Adata.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-289256138624-github-assume: Read complete after 0s [id=2022835186]%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Aaws_iam_role.ih-tf-aws-control-289256138624-github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]%0Aaws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]%0Aaws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0Adata.aws_iam_policy_document.ih-tf-aws-control-289256138624-admin-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-289256138624-admin-assume: Read complete after 0s [id=413646908]%0Aaws_iam_role.ih-tf-aws-control-289256138624-admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230701234510837900000001]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions will be destroyed%0A  # (because aws_iam_policy.ih-tf-aws-control-289256138624-state-manager-permissions is not in configuration)%0A  - resource "aws_iam_policy" "ih-tf-aws-control-289256138624-state-manager-permissions" {%0A      - arn         = "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001" -> null%0A      - id          = "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001" -> null%0A      - name        = "terraform-20230701232847347400000001" -> null%0A      - name_prefix = "terraform-" -> null%0A      - path        = "/" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "s3:ListBucket"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:PutObject",%0A                          - "s3:GetObject",%0A                          - "s3:DeleteObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "dynamodb:PutItem",%0A                          - "dynamodb:GetItem",%0A                          - "dynamodb:DescribeTable",%0A                          - "dynamodb:DeleteItem",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id   = "ANPAUGWICM6AE5CIHYDMM" -> null%0A      - tags        = {} -> null%0A      - tags_all    = {%0A          - "created_by" = "infrahouse/aws-control-289256138624"%0A        } -> null%0A    }%0A%0A  # aws_iam_role.ih-tf-aws-control-289256138624-state-manager will be destroyed%0A  # (because aws_iam_role.ih-tf-aws-control-289256138624-state-manager is not in configuration)%0A  - resource "aws_iam_role" "ih-tf-aws-control-289256138624-state-manager" {%0A      - arn                   = "arn:aws:iam::289256138624:role/ih-tf-aws-control-289256138624-state-manager" -> null%0A      - assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = [%0A                              - "arn:aws:iam::990466748045:user/aleks",%0A                              - "arn:aws:iam::289256138624:role/ih-tf-aws-control-289256138624-github",%0A                            ]%0A                        }%0A                      - Sid       = "000"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - create_date           = "2023-07-01T23:19:10Z" -> null%0A      - description           = "Role to manage state of the repo aws-control-289256138624" -> null%0A      - force_detach_policies = false -> null%0A      - id                    = "ih-tf-aws-control-289256138624-state-manager" -> null%0A      - managed_policy_arns   = [%0A          - "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001",%0A        ] -> null%0A      - max_session_duration  = 3600 -> null%0A      - name                  = "ih-tf-aws-control-289256138624-state-manager" -> null%0A      - path                  = "/" -> null%0A      - role_last_used        = [%0A          - {%0A              - last_used_date = "2023-07-02T00:38:00Z"%0A              - region         = "us-west-1"%0A            },%0A        ] -> null%0A      - tags                  = {} -> null%0A      - tags_all              = {%0A          - "created_by" = "infrahouse/aws-control-289256138624"%0A        } -> null%0A      - unique_id             = "AROAUGWICM6AF2JU3CT2L" -> null%0A    }%0A%0A  # aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager will be destroyed%0A  # (because aws_iam_role_policy_attachment.ih-tf-aws-control-289256138624-state-manager is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "ih-tf-aws-control-289256138624-state-manager" {%0A      - id         = "ih-tf-aws-control-289256138624-state-manager-20230701232848037400000002" -> null%0A      - policy_arn = "arn:aws:iam::289256138624:policy/terraform-20230701232847347400000001" -> null%0A      - role       = "ih-tf-aws-control-289256138624-state-manager" -> null%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions will be created%0A  + resource "aws_iam_policy" "permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624"%0A                      + Sid      = ""%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:GetObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-289256138624/terraform.tfstate"%0A                      + Sid      = ""%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "aws_dynamodb_table.terraform_locks.arn"%0A                      + Sid      = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager will be created%0A  + resource "aws_iam_role" "state-manager" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "aws_iam_role.ih-tf-aws-control-289256138624-github.arn",%0A                              + "arn:aws:iam::990466748045:user/aleks",%0A                            ]%0A                        }%0A                      + Sid       = "000"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to manage a terraform state of a repo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-aws-control-289256138624-state-manager"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-289256138624-state-manager"%0A    }%0A%0APlan: 3 to add, 0 to change, 3 to destroy.%0A%0AWarning: Reference to undefined provider%0A%0A  on aws_iam_role.ih-tf-aws-control-289256138624-state-manager.tf line 6, in module "ih-tf-aws-control-289256138624-state-manager":%0A   6:     aws = aws.aws-289256138624-uw1%0A%0AThere is no explicit declaration for local provider name "aws" in%0Amodule.ih-tf-aws-control-289256138624-state-manager, so Terraform is assuming%0Ayou mean to pass a configuration for "hashicorp/aws".%0A%0AIf you also control the child module, add a required_providers entry named%0A"aws" with the source address "hashicorp/aws".%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC83MjFkZDQwYi04ZmZhLTQ3YjYtOTZlNC1hYTIxNjY0OWFlNjQvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci0yMDIzMDcwMTIzMjg0ODAzNzQwMDAwMDAwMl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxuYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxuYXdzX2lhbV9wb2xpY3kuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L3RlcnJhZm9ybS0yMDIzMDcwMTIzMjg0NzM0NzQwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MDM2MjM0NTJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE3NTkyMDM5NTddXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE2MDM3NzQ0ODVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDIyODM1MTg2XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1naXRodWItY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTIxMTI5NzM3XVxuYXdzX2lhbV9yb2xlLmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbF1cbmF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXVxuYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbF1cbmF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTM2NDY5MDhdXG5hd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW5dXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWdpdGh1Yi1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC0yMDIzMDYyNzE3MjczNDM3MDQwMDAwMDAwMl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi0yMDIzMDcwMTIzNDUxMDgzNzkwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjAyMzA2MzAwMDM1MzA1MzA5MDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjI3MTcyNzMzOTMxMjAwMDAwMDAxXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIC0gZGVzdHJveVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIGF3c19pYW1fcG9saWN5LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXBlcm1pc3Npb25zIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgYXdzX2lhbV9wb2xpY3kuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcGVybWlzc2lvbnMgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcGVybWlzc2lvbnNcIiB7XG4gICAgICAtIGFybiAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS90ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS90ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIG5hbWUgICAgICAgID0gXCJ0ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIG5hbWVfcHJlZml4ID0gXCJ0ZXJyYWZvcm0tXCIgLT4gbnVsbFxuICAgICAgLSBwYXRoICAgICAgICA9IFwiL1wiIC0+IG51bGxcbiAgICAgIC0gcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICAtIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgIC0ge1xuICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJzMzpHZXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvdGVycmFmb3JtLnRmc3RhdGVcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgICkgLT4gbnVsbFxuICAgICAgLSBwb2xpY3lfaWQgICA9IFwiQU5QQVVHV0lDTTZBRTVDSUhZRE1NXCIgLT4gbnVsbFxuICAgICAgLSB0YWdzICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9IC0+IG51bGxcbiAgICB9XG5cbiAgIyBhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIge1xuICAgICAgLSBhcm4gICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cm9sZS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiIC0+IG51bGxcbiAgICAgIC0gYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gQVdTID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cm9sZS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgID0gXCIwMDBcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgLSBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApIC0+IG51bGxcbiAgICAgIC0gY3JlYXRlX2RhdGUgICAgICAgICAgID0gXCIyMDIzLTA3LTAxVDIzOjE5OjEwWlwiIC0+IG51bGxcbiAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIG1hbmFnZSBzdGF0ZSBvZiB0aGUgcmVwbyBhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiAtPiBudWxsXG4gICAgICAtIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiIC0+IG51bGxcbiAgICAgIC0gbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gW1xuICAgICAgICAgIC0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS90ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIixcbiAgICAgICAgXSAtPiBudWxsXG4gICAgICAtIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDAgLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbFxuICAgICAgLSBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiAtPiBudWxsXG4gICAgICAtIHJvbGVfbGFzdF91c2VkICAgICAgICA9IFtcbiAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgLSBsYXN0X3VzZWRfZGF0ZSA9IFwiMjAyMy0wNy0wMlQwMDozODowMFpcIlxuICAgICAgICAgICAgICAtIHJlZ2lvbiAgICAgICAgID0gXCJ1cy13ZXN0LTFcIlxuICAgICAgICAgICAgfSxcbiAgICAgICAgXSAtPiBudWxsXG4gICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfSAtPiBudWxsXG4gICAgICAtIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IFwiQVJPQVVHV0lDTTZBRjJKVTNDVDJMXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlciB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlciBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIiB7XG4gICAgICAtIGlkICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAxMjMyODQ4MDM3NDAwMDAwMDAyXCIgLT4gbnVsbFxuICAgICAgLSBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS90ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIiAtPiBudWxsXG4gICAgICAtIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpHZXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQvdGVycmFmb3JtLnRmc3RhdGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzLmFyblwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJzdGF0ZS1tYW5hZ2VyXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yi5hcm5cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnVzZXIvYWxla3NcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICAgPSBcIjAwMFwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gbWFuYWdlIGEgdGVycmFmb3JtIHN0YXRlIG9mIGEgcmVwb1wiXG4gICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHJvbGVfbGFzdF91c2VkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDMgdG8gZGVzdHJveS5cblxuV2FybmluZzogUmVmZXJlbmNlIHRvIHVuZGVmaW5lZCBwcm92aWRlclxuXG4gIG9uIGF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci50ZiBsaW5lIDYsIGluIG1vZHVsZSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCI6XG4gICA2OiAgICAgYXdzID0gYXdzLmF3cy0yODkyNTYxMzg2MjQtdXcxXG5cblRoZXJlIGlzIG5vIGV4cGxpY2l0IGRlY2xhcmF0aW9uIGZvciBsb2NhbCBwcm92aWRlciBuYW1lIFwiYXdzXCIgaW5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlciwgc28gVGVycmFmb3JtIGlzIGFzc3VtaW5nXG55b3UgbWVhbiB0byBwYXNzIGEgY29uZmlndXJhdGlvbiBmb3IgXCJoYXNoaWNvcnAvYXdzXCIuXG5cbklmIHlvdSBhbHNvIGNvbnRyb2wgdGhlIGNoaWxkIG1vZHVsZSwgYWRkIGEgcmVxdWlyZWRfcHJvdmlkZXJzIGVudHJ5IG5hbWVkXG5cImF3c1wiIHdpdGggdGhlIHNvdXJjZSBhZGRyZXNzIFwiaGFzaGljb3JwL2F3c1wiLlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBhd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAxMjMyODQ4MDM3NDAwMDAwMDAyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFhd3NfaWFtX3BvbGljeS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvdGVycmFmb3JtLTIwMjMwNzAxMjMyODQ3MzQ3NDAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzAzNjIzNDUyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTc1OTIwMzk1N10lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTYwMzc3NDQ4NV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAyMjgzNTE4Nl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1naXRodWItY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1MjExMjk3MzddJTBBYXdzX2lhbV9yb2xlLmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbF0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yl0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sXSUwQWF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxMzY0NjkwOF0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW5dJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLTIwMjMwNjI3MTcyNzM0MzcwNDAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi0yMDIzMDcwMTIzNDUxMDgzNzkwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTIwMjMwNjMwMDAzNTMwNTMwOTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzM5MzEyMDAwMDAwMDFdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBICAtIGRlc3Ryb3klMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgYXdzX2lhbV9wb2xpY3kuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcGVybWlzc2lvbnMgd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgYXdzX2lhbV9wb2xpY3kuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcGVybWlzc2lvbnMgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgIC0gYXJuICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L3RlcnJhZm9ybS0yMDIzMDcwMTIzMjg0NzM0NzQwMDAwMDAwMVwiIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS90ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIiAtPiBudWxsJTBBICAgICAgLSBuYW1lICAgICAgICA9IFwidGVycmFmb3JtLTIwMjMwNzAxMjMyODQ3MzQ3NDAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gbmFtZV9wcmVmaXggPSBcInRlcnJhZm9ybS1cIiAtPiBudWxsJTBBICAgICAgLSBwYXRoICAgICAgICA9IFwiL1wiIC0+IG51bGwlMEEgICAgICAtIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICAtIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6R2V0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiczM6RGVsZXRlT2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC90ZXJyYWZvcm0udGZzdGF0ZVwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOlB1dEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJkeW5hbW9kYjpHZXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgIC0gVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApIC0+IG51bGwlMEEgICAgICAtIHBvbGljeV9pZCAgID0gXCJBTlBBVUdXSUNNNkFFNUNJSFlETU1cIiAtPiBudWxsJTBBICAgICAgLSB0YWdzICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICAtIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIgd2lsbCBiZSBkZXN0cm95ZWQlMEEgICMgKGJlY2F1c2UgYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKSUwQSAgLSByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIiB7JTBBICAgICAgLSBhcm4gICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cm9sZS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiIC0+IG51bGwlMEEgICAgICAtIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgLSBBV1MgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnJvbGUvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1YlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgICA9IFwiMDAwXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgIC0gVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApIC0+IG51bGwlMEEgICAgICAtIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IFwiMjAyMy0wNy0wMVQyMzoxOToxMFpcIiAtPiBudWxsJTBBICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gbWFuYWdlIHN0YXRlIG9mIHRoZSByZXBvIGF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiIC0+IG51bGwlMEEgICAgICAtIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlIC0+IG51bGwlMEEgICAgICAtIGlkICAgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIiAtPiBudWxsJTBBICAgICAgLSBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSBbJTBBICAgICAgICAgIC0gXCJhcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS90ZXJyYWZvcm0tMjAyMzA3MDEyMzI4NDczNDc0MDAwMDAwMDFcIiwlMEEgICAgICAgIF0gLT4gbnVsbCUwQSAgICAgIC0gbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMCAtPiBudWxsJTBBICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIgLT4gbnVsbCUwQSAgICAgIC0gcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIgLT4gbnVsbCUwQSAgICAgIC0gcm9sZV9sYXN0X3VzZWQgICAgICAgID0gWyUwQSAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgIC0gbGFzdF91c2VkX2RhdGUgPSBcIjIwMjMtMDctMDJUMDA6Mzg6MDBaXCIlMEEgICAgICAgICAgICAgIC0gcmVnaW9uICAgICAgICAgPSBcInVzLXdlc3QtMVwiJTBBICAgICAgICAgICAgfSwlMEEgICAgICAgIF0gLT4gbnVsbCUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgIC0gdGFnc19hbGwgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9IC0+IG51bGwlMEEgICAgICAtIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IFwiQVJPQVVHV0lDTTZBRjJKVTNDVDJMXCIgLT4gbnVsbCUwQSAgICB9JTBBJTBBICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlciB3aWxsIGJlIGRlc3Ryb3llZCUwQSAgIyAoYmVjYXVzZSBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIgaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pJTBBICAtIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiIHslMEEgICAgICAtIGlkICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAxMjMyODQ4MDM3NDAwMDAwMDAyXCIgLT4gbnVsbCUwQSAgICAgIC0gcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvdGVycmFmb3JtLTIwMjMwNzAxMjMyODQ3MzQ3NDAwMDAwMDAxXCIgLT4gbnVsbCUwQSAgICAgIC0gcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJcIiAtPiBudWxsJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpQdXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpHZXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzLmFyblwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInN0YXRlLW1hbmFnZXJcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgQVdTID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yi5hcm5cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgID0gXCIwMDBcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byBtYW5hZ2UgYSB0ZXJyYWZvcm0gc3RhdGUgb2YgYSByZXBvXCIlMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiJTBBICAgICAgKyByb2xlX2xhc3RfdXNlZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDMgdG8gZGVzdHJveS4lMEElMEFXYXJuaW5nOiBSZWZlcmVuY2UgdG8gdW5kZWZpbmVkIHByb3ZpZGVyJTBBJTBBICBvbiBhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIudGYgbGluZSA2LCBpbiBtb2R1bGUgXCJpaC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlclwiOiUwQSAgIDY6ICAgICBhd3MgPSBhd3MuYXdzLTI4OTI1NjEzODYyNC11dzElMEElMEFUaGVyZSBpcyBubyBleHBsaWNpdCBkZWNsYXJhdGlvbiBmb3IgbG9jYWwgcHJvdmlkZXIgbmFtZSBcImF3c1wiIGluJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLCBzbyBUZXJyYWZvcm0gaXMgYXNzdW1pbmclMEF5b3UgbWVhbiB0byBwYXNzIGEgY29uZmlndXJhdGlvbiBmb3IgXCJoYXNoaWNvcnAvYXdzXCIuJTBBJTBBSWYgeW91IGFsc28gY29udHJvbCB0aGUgY2hpbGQgbW9kdWxlLCBhZGQgYSByZXF1aXJlZF9wcm92aWRlcnMgZW50cnkgbmFtZWQlMEFcImF3c1wiIHdpdGggdGhlIHNvdXJjZSBhZGRyZXNzIFwiaGFzaGljb3JwL2F3c1wiLiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAzLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAzfX0=```
</p></details>